#### 📖 Terraform Plan ('infra/resources/prod') - failure
<details>
<summary>Terraform Plan</summary>

```hcl
module.web_apps.module.push_notif_function[0].data.azurerm_private_dns_zone.storage_account_file: Still reading... [10s elapsed]
module.web_apps.module.push_notif_function[0].data.azurerm_private_dns_zone.function_app: Still reading... [10s elapsed]
module.web_apps.module.push_notif_function[0].data.azurerm_private_dns_zone.storage_account_table[0]: Still reading... [10s elapsed]
module.web_apps.module.push_notif_function[0].data.azurerm_private_dns_zone.storage_account_queue: Still reading... [10s elapsed]
module.web_apps.module.push_notif_function[0].data.azurerm_private_dns_zone.storage_account_blob: Still reading... [10s elapsed]
module.web_apps.module.push_notif_function[0].data.azurerm_private_dns_zone.storage_account_file: Still reading... [20s elapsed]
module.web_apps.module.push_notif_function[0].data.azurerm_private_dns_zone.function_app: Still reading... [20s elapsed]
module.web_apps.module.push_notif_function[0].data.azurerm_private_dns_zone.storage_account_table[0]: Still reading... [20s elapsed]
module.web_apps.module.push_notif_function[0].data.azurerm_private_dns_zone.storage_account_queue: Still reading... [20s elapsed]
module.web_apps.module.push_notif_function[0].data.azurerm_private_dns_zone.storage_account_blob: Still reading... [20s elapsed]
module.functions_messages_sending.module.function_app_messages_sending.azurerm_role_assignment.function_sto
Error: Private Dns Zone (Subscription: "ec285037-c673-4f58-b594-d7c480da4e8b"
Resource Group Name: "io-p-itn-common-rg-01"
Private Dns Zone Name: "privatelink.blob.core.windows.net") was not found

  with module.web_apps.module.push_notif_function[0].data.azurerm_private_dns_zone.storage_account_blob,
  on .terraform/modules/web_apps.push_notif_function/data.tf line 6, in data "azurerm_private_dns_zone" "storage_account_blob":
   6: data "azurerm_private_dns_zone" "storage_account_blob" {


Error: Private Dns Zone (Subscription: "ec285037-c673-4f58-b594-d7c480da4e8b"
Resource Group Name: "io-p-itn-common-rg-01"
Private Dns Zone Name: "privatelink.file.core.windows.net") was not found

  with module.web_apps.module.push_notif_function[0].data.azurerm_private_dns_zone.storage_account_file,
  on .terraform/modules/web_apps.push_notif_function/data.tf line 11, in data "azurerm_private_dns_zone" "storage_account_file":
  11: data "azurerm_private_dns_zone" "storage_account_file" {


Error: Private Dns Zone (Subscription: "ec285037-c673-4f58-b594-d7c480da4e8b"
Resource Group Name: "io-p-itn-common-rg-01"
Private Dns Zone Name: "privatelink.queue.core.windows.net") was not found

  with module.web_apps.module.push_notif_function[0].data.azurerm_private_dns_zone.storage_account_queue,
  on .terraform/modules/web_apps.push_notif_function/data.tf line 16, in data "azurerm_private_dns_zone" "storage_account_queue":
  16: data "azurerm_private_dns_zone" "storage_account_queue" {


Error: Private Dns Zone (Subscription: "ec285037-c673-4f58-b594-d7c480da4e8b"
Resource Group Name: "io-p-itn-common-rg-01"
Private Dns Zone Name: "privatelink.table.core.windows.net") was not found

  with module.web_apps.module.push_notif_function[0].data.azurerm_private_dns_zone.storage_account_table[0],
  on .terraform/modules/web_apps.push_notif_function/data.tf line 21, in data "azurerm_private_dns_zone" "storage_account_table":
  21: data "azurerm_private_dns_zone" "storage_account_table" {


Error: Private Dns Zone (Subscription: "ec285037-c673-4f58-b594-d7c480da4e8b"
Resource Group Name: "io-p-itn-common-rg-01"
Private Dns Zone Name: "privatelink.azurewebsites.net") was not found

  with module.web_apps.module.push_notif_function[0].data.azurerm_private_dns_zone.function_app,
  on .terraform/modules/web_apps.push_notif_function/data.tf line 28, in data "azurerm_private_dns_zone" "function_app":
  28: data "azurerm_private_dns_zone" "function_app" {

module.web_apps.module.push_notif_function[0].data.azurerm_private_dns_zone.storage_account_file: Still reading... [30s elapsed]
module.web_apps.module.push_notif_function[0].data.azurerm_private_dns_zone.function_app: Still reading... [30s elapsed]
module.web_apps.module.push_notif_function[0].data.azurerm_private_dns_zone.storage_account_table[0]: Still reading... [30s elapsed]
module.web_apps.module.push_notif_function[0].data.azurerm_private_dns_zone.storage_account_queue: Still reading... [30s elapsed]
module.web_apps.module.push_notif_function[0].data.azurerm_private_dns_zone.storage_account_blob: Still reading... [30s elapsed]
module.web_apps.module.push_notif_function[0].data.azurerm_private_dns_zone.storage_account_file: Still reading... [40s elapsed]
module.web_apps.module.push_notif_function[0].data.azurerm_private_dns_zone.function_app: Still reading... [40s elapsed]
module.web_apps.module.push_notif_function[0].data.azurerm_private_dns_zone.storage_account_table[0]: Still reading... [40s elapsed]
module.web_apps.module.push_notif_function[0].data.azurerm_private_dns_zone.storage_account_queue: Still reading... [40s elapsed]
module.web_apps.module.push_notif_function[0].data.azurerm_private_dns_zone.storage_account_blob: Still reading... [40s elapsed]
module.web_apps.module.push_notif_function[0].data.azurerm_private_dns_zone.storage_account_file: Still reading... [50s elapsed]
module.web_apps.module.push_notif_function[0].data.azurerm_private_dns_zone.function_app: Still reading... [50s elapsed]
module.web_apps.module.push_notif_function[0].data.azurerm_private_dns_zone.storage_account_table[0]: Still reading... [50s elapsed]
module.web_apps.module.push_notif_function[0].data.azurerm_private_dns_zone.storage_account_queue: Still reading... [50s elapsed]
module.web_apps.module.push_notif_function[0].data.azurerm_private_dns_zone.storage_account_blob: Still reading... [50s elapsed]
module.web_apps.module.push_notif_function[0].data.azurerm_private_dns_zone.storage_account_file: Still reading... [1m0s elapsed]
module.web_apps.module.push_notif_function[0].data.azurerm_private_dns_zone.function_app: Still reading... [1m0s elapsed]
module.web_apps.module.push_notif_function[0].data.azurerm_private_dns_zone.storage_account_table[0]: Still reading... [1m0s elapsed]
module.web_apps.module.push_notif_function[0].data.azurerm_private_dns_zone.storage_account_queue: Still reading... [1m0s elapsed]
module.web_apps.module.push_notif_function[0].data.azurerm_private_dns_zone.storage_account_blob: Still reading... [1m0s elapsed]
module.web_apps.module.citizen_func_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.web_apps.module.etl_func_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.web_apps.module.push_notif_function[0].azurerm_monitor_metric_alert.storage_account_health_check[0] will be created
  + resource "azurerm_monitor_metric_alert" "storage_account_health_check" {
      + auto_mitigate            = false
      + description              = "The average availability is less than 99.8%. Runbook: not needed."
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "[iopitncompushnotifstfn01] Low Availability"
      + resource_group_name      = "io-p-itn-com-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 0
      + tags                     = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01"
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "Availability"
          + metric_namespace       = "Microsoft.Storage/storageAccounts"
          + operator               = "LessThan"
          + skip_metric_validation = false
          + threshold              = 99.8
        }
    }

  # module.web_apps.module.push_notif_function[0].azurerm_service_plan.this[0] will be created
  + resource "azurerm_service_plan" "this" {
      + id                              = (known after apply)
      + kind                            = (known after apply)
      + location                        = "italynorth"
      + maximum_elastic_worker_count    = (known after apply)
      + name                            = "io-p-itn-com-pushnotif-asp-01"
      + os_type                         = "Linux"
      + per_site_scaling_enabled        = false
      + premium_plan_auto_scale_enabled = false
      + reserved                        = (known after apply)
      + resource_group_name             = "io-p-itn-com-rg-01"
      + sku_name                        = "P1v3"
      + tags                            = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
      + worker_count                    = (known after apply)
      + zone_balancing_enabled          = true
    }

  # module.web_apps.module.push_notif_function[0].azurerm_storage_account.durable_function[0] will be created
  + resource "azurerm_storage_account" "durable_function" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "ZRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = true
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "italynorth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "iopitncompushnotifstfd01"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = false
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "io-p-itn-com-rg-01"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = false
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }

      + blob_properties (known after apply)

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.web_apps.module.push_notif_function[0].azurerm_storage_account.this will be created
  + resource "azurerm_storage_account" "this" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "ZRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = true
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "italynorth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "iopitncompushnotifstfn01"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = false
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "io-p-itn-com-rg-01"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = false
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }

      + blob_properties (known after apply)

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.web_apps.module.push_notif_function[0].azurerm_subnet.this[0] will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                              = [
          + "10.20.8.0/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "io-p-itn-com-pushnotif-func-snet-01"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "io-p-itn-common-rg-01"
      + virtual_network_name                          = "io-p-itn-common-vnet-01"

      + delegation {
          + name = "default"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.storage_api_weu.azurerm_storage_container.message_content,
  on ../_modules/storage_accounts/storage_account_api.tf line 32, in resource "azurerm_storage_container" "message_content":
  32:   storage_account_name  = module.storage_api.name

the `storage_account_name` property has been deprecated in favour of
`storage_account_id` and will be removed in version 5.0 of the Provider.

(and 5 more similar warnings elsewhere)
module.web_apps.module.push_notif_function[0].data.azurerm_private_dns_zone.storage_account_file: Still reading... [1m10s elapsed]
module.web_apps.module.push_notif_function[0].data.azurerm_private_dns_zone.function_app: Still reading... [1m10s elapsed]
module.web_apps.module.push_notif_function[0].data.azurerm_private_dns_zone.storage_account_table[0]: Still reading... [1m10s elapsed]
module.web_apps.module.push_notif_function[0].data.azurerm_private_dns_zone.storage_account_queue: Still reading... [1m10s elapsed]
::error::Terraform exited with code 1.
```

</details>
